espressif/esp-idf/components/soc/esp32s3/include/soc/usb_device_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_USB_DEVICE_REG_H_
#define _SOC_USB_DEVICE_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define USB_DEVICE_EP1_REG          (DR_REG_USB_DEVICE_BASE + 0x0)
/* USB_DEVICE_RDWR_BYTE : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: Write and read byte data to/from UART Tx/Rx FIFO through this field. When USB_DE
VICE_SERIAL_IN_EMPTY_INT is set, then user can write data (up to 64 bytes) into
UART Tx FIFO. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is set, user can check USB
_DEVICE_OUT_EP1_WR_ADDR USB_DEVICE_OUT_EP0_RD_ADDR to know how many data is rece
ived, then read data from UART Rx FIFO..*/
#define USB_DEVICE_RDWR_BYTE    0x000000FF
#define USB_DEVICE_RDWR_BYTE_M  ((USB_DEVICE_RDWR_BYTE_V)<<(USB_DEVICE_RDWR_BYTE_S))
#define USB_DEVICE_RDWR_BYTE_V  0xFF
#define USB_DEVICE_RDWR_BYTE_S  0

#define USB_DEVICE_EP1_CONF_REG          (DR_REG_USB_DEVICE_BASE + 0x4)
/* USB_DEVICE_SERIAL_OUT_EP_DATA_AVAIL : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: 1'b1: Indicate there is data in UART Rx FIFO..*/
#define USB_DEVICE_SERIAL_OUT_EP_DATA_AVAIL    (BIT(2))
#define USB_DEVICE_SERIAL_OUT_EP_DATA_AVAIL_M  (BIT(2))
#define USB_DEVICE_SERIAL_OUT_EP_DATA_AVAIL_V  0x1
#define USB_DEVICE_SERIAL_OUT_EP_DATA_AVAIL_S  2
/* USB_DEVICE_SERIAL_IN_EP_DATA_FREE : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: 1'b1: Indicate UART Tx FIFO is not full and can write data into in. After writin
g USB_DEVICE_WR_DONE, this bit would be 0 until data in UART Tx FIFO is read by
USB Host..*/
#define USB_DEVICE_SERIAL_IN_EP_DATA_FREE    (BIT(1))
#define USB_DEVICE_SERIAL_IN_EP_DATA_FREE_M  (BIT(1))
#define USB_DEVICE_SERIAL_IN_EP_DATA_FREE_V  0x1
#define USB_DEVICE_SERIAL_IN_EP_DATA_FREE_S  1
/* USB_DEVICE_WR_DONE : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to indicate writing byte data to UART Tx FIFO is done..*/
#define USB_DEVICE_WR_DONE    (BIT(0))
#define USB_DEVICE_WR_DONE_M  (BIT(0))
#define USB_DEVICE_WR_DONE_V  0x1
#define USB_DEVICE_WR_DONE_S  0

#define USB_DEVICE_INT_RAW_REG          (DR_REG_USB_DEVICE_BASE + 0x8)
/* USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_RAW : R/WTC/SS ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when OUT endpoint 2 received packet wi
th zero palyload..*/
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_RAW    (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_RAW_M  (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_RAW_V  0x1
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_RAW_S  11
/* USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_RAW : R/WTC/SS ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when OUT endpoint 1 received packet wi
th zero palyload..*/
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_RAW    (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_RAW_M  (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_RAW_V  0x1
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_RAW_S  10
/* USB_DEVICE_USB_BUS_RESET_INT_RAW : R/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when usb bus reset is detected..*/
#define USB_DEVICE_USB_BUS_RESET_INT_RAW    (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_RAW_M  (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_RAW_V  0x1
#define USB_DEVICE_USB_BUS_RESET_INT_RAW_S  9
/* USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_RAW : R/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when IN token for IN endpoint 1 is rec
eived..*/
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_RAW    (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_RAW_M  (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_RAW_V  0x1
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_RAW_S  8
/* USB_DEVICE_STUFF_ERR_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when stuff error is detected..*/
#define USB_DEVICE_STUFF_ERR_INT_RAW    (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_RAW_M  (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_RAW_V  0x1
#define USB_DEVICE_STUFF_ERR_INT_RAW_S  7
/* USB_DEVICE_CRC16_ERR_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when CRC16 error is detected..*/
#define USB_DEVICE_CRC16_ERR_INT_RAW    (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_RAW_M  (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_RAW_V  0x1
#define USB_DEVICE_CRC16_ERR_INT_RAW_S  6
/* USB_DEVICE_CRC5_ERR_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when CRC5 error is detected..*/
#define USB_DEVICE_CRC5_ERR_INT_RAW    (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_RAW_M  (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_RAW_V  0x1
#define USB_DEVICE_CRC5_ERR_INT_RAW_S  5
/* USB_DEVICE_PID_ERR_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when pid error is detected..*/
#define USB_DEVICE_PID_ERR_INT_RAW    (BIT(4))
#define USB_DEVICE_PID_ERR_INT_RAW_M  (BIT(4))
#define USB_DEVICE_PID_ERR_INT_RAW_V  0x1
#define USB_DEVICE_PID_ERR_INT_RAW_S  4
/* USB_DEVICE_SERIAL_IN_EMPTY_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b1 ; */
/*description: The raw interrupt bit turns to high level when Serial Port IN Endpoint is empty..*/
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_RAW    (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_RAW_M  (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_RAW_V  0x1
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_RAW_S  3
/* USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Serial Port OUT Endpoint received
 one packet..*/
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_RAW    (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_RAW_M  (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_RAW_V  0x1
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_RAW_S  2
/* USB_DEVICE_SOF_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when SOF frame is received..*/
#define USB_DEVICE_SOF_INT_RAW    (BIT(1))
#define USB_DEVICE_SOF_INT_RAW_M  (BIT(1))
#define USB_DEVICE_SOF_INT_RAW_V  0x1
#define USB_DEVICE_SOF_INT_RAW_S  1
/* USB_DEVICE_JTAG_IN_FLUSH_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when flush cmd is received for IN endp
oint 2 of JTAG..*/
#define USB_DEVICE_JTAG_IN_FLUSH_INT_RAW    (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_RAW_M  (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_RAW_V  0x1
#define USB_DEVICE_JTAG_IN_FLUSH_INT_RAW_S  0

#define USB_DEVICE_INT_ST_REG          (DR_REG_USB_DEVICE_BASE + 0xC)
/* USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interru
pt..*/
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ST    (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ST_M  (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ST_V  0x1
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ST_S  11
/* USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interru
pt..*/
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ST    (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ST_M  (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ST_V  0x1
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ST_S  10
/* USB_DEVICE_USB_BUS_RESET_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt..*/
#define USB_DEVICE_USB_BUS_RESET_INT_ST    (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_ST_M  (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_ST_V  0x1
#define USB_DEVICE_USB_BUS_RESET_INT_ST_S  9
/* USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrup
t..*/
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ST    (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ST_M  (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ST_V  0x1
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ST_S  8
/* USB_DEVICE_STUFF_ERR_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_STUFF_ERR_INT interrupt..*/
#define USB_DEVICE_STUFF_ERR_INT_ST    (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_ST_M  (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_ST_V  0x1
#define USB_DEVICE_STUFF_ERR_INT_ST_S  7
/* USB_DEVICE_CRC16_ERR_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_CRC16_ERR_INT interrupt..*/
#define USB_DEVICE_CRC16_ERR_INT_ST    (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_ST_M  (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_ST_V  0x1
#define USB_DEVICE_CRC16_ERR_INT_ST_S  6
/* USB_DEVICE_CRC5_ERR_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_CRC5_ERR_INT interrupt..*/
#define USB_DEVICE_CRC5_ERR_INT_ST    (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_ST_M  (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_ST_V  0x1
#define USB_DEVICE_CRC5_ERR_INT_ST_S  5
/* USB_DEVICE_PID_ERR_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_PID_ERR_INT interrupt..*/
#define USB_DEVICE_PID_ERR_INT_ST    (BIT(4))
#define USB_DEVICE_PID_ERR_INT_ST_M  (BIT(4))
#define USB_DEVICE_PID_ERR_INT_ST_V  0x1
#define USB_DEVICE_PID_ERR_INT_ST_S  4
/* USB_DEVICE_SERIAL_IN_EMPTY_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt..*/
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ST    (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ST_M  (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ST_V  0x1
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ST_S  3
/* USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrup
t..*/
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ST    (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ST_M  (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ST_V  0x1
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ST_S  2
/* USB_DEVICE_SOF_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_SOF_INT interrupt..*/
#define USB_DEVICE_SOF_INT_ST    (BIT(1))
#define USB_DEVICE_SOF_INT_ST_M  (BIT(1))
#define USB_DEVICE_SOF_INT_ST_V  0x1
#define USB_DEVICE_SOF_INT_ST_S  1
/* USB_DEVICE_JTAG_IN_FLUSH_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt..*/
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ST    (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ST_M  (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ST_V  0x1
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ST_S  0

