espressif/esp-idf/components/soc/esp32s3/include/soc/usb_device_reg.h
#define USB_DEVICE_INT_ENA_REG          (DR_REG_USB_DEVICE_BASE + 0x10)
/* USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt..*/
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ENA    (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ENA_M  (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ENA_V  0x1
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_ENA_S  11
/* USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt..*/
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ENA    (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ENA_M  (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ENA_V  0x1
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_ENA_S  10
/* USB_DEVICE_USB_BUS_RESET_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt..*/
#define USB_DEVICE_USB_BUS_RESET_INT_ENA    (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_ENA_M  (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_ENA_V  0x1
#define USB_DEVICE_USB_BUS_RESET_INT_ENA_S  9
/* USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrupt..*/
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ENA    (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ENA_M  (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ENA_V  0x1
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_ENA_S  8
/* USB_DEVICE_STUFF_ERR_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_STUFF_ERR_INT interrupt..*/
#define USB_DEVICE_STUFF_ERR_INT_ENA    (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_ENA_M  (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_ENA_V  0x1
#define USB_DEVICE_STUFF_ERR_INT_ENA_S  7
/* USB_DEVICE_CRC16_ERR_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_CRC16_ERR_INT interrupt..*/
#define USB_DEVICE_CRC16_ERR_INT_ENA    (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_ENA_M  (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_ENA_V  0x1
#define USB_DEVICE_CRC16_ERR_INT_ENA_S  6
/* USB_DEVICE_CRC5_ERR_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_CRC5_ERR_INT interrupt..*/
#define USB_DEVICE_CRC5_ERR_INT_ENA    (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_ENA_M  (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_ENA_V  0x1
#define USB_DEVICE_CRC5_ERR_INT_ENA_S  5
/* USB_DEVICE_PID_ERR_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_PID_ERR_INT interrupt..*/
#define USB_DEVICE_PID_ERR_INT_ENA    (BIT(4))
#define USB_DEVICE_PID_ERR_INT_ENA_M  (BIT(4))
#define USB_DEVICE_PID_ERR_INT_ENA_V  0x1
#define USB_DEVICE_PID_ERR_INT_ENA_S  4
/* USB_DEVICE_SERIAL_IN_EMPTY_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt..*/
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ENA    (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ENA_M  (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ENA_V  0x1
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_ENA_S  3
/* USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt..*/
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ENA    (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ENA_M  (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ENA_V  0x1
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_ENA_S  2
/* USB_DEVICE_SOF_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_SOF_INT interrupt..*/
#define USB_DEVICE_SOF_INT_ENA    (BIT(1))
#define USB_DEVICE_SOF_INT_ENA_M  (BIT(1))
#define USB_DEVICE_SOF_INT_ENA_V  0x1
#define USB_DEVICE_SOF_INT_ENA_S  1
/* USB_DEVICE_JTAG_IN_FLUSH_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt..*/
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ENA    (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ENA_M  (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ENA_V  0x1
#define USB_DEVICE_JTAG_IN_FLUSH_INT_ENA_S  0

#define USB_DEVICE_INT_CLR_REG          (DR_REG_USB_DEVICE_BASE + 0x14)
/* USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_CLR : WT ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt..*/
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_CLR    (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_CLR_M  (BIT(11))
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_CLR_V  0x1
#define USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT_CLR_S  11
/* USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_CLR : WT ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt..*/
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_CLR    (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_CLR_M  (BIT(10))
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_CLR_V  0x1
#define USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT_CLR_S  10
/* USB_DEVICE_USB_BUS_RESET_INT_CLR : WT ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_USB_BUS_RESET_INT interrupt..*/
#define USB_DEVICE_USB_BUS_RESET_INT_CLR    (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_CLR_M  (BIT(9))
#define USB_DEVICE_USB_BUS_RESET_INT_CLR_V  0x1
#define USB_DEVICE_USB_BUS_RESET_INT_CLR_S  9
/* USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_CLR : WT ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_IN_TOKEN_IN_EP1_INT interrupt..*/
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_CLR    (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_CLR_M  (BIT(8))
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_CLR_V  0x1
#define USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT_CLR_S  8
/* USB_DEVICE_STUFF_ERR_INT_CLR : WT ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_STUFF_ERR_INT interrupt..*/
#define USB_DEVICE_STUFF_ERR_INT_CLR    (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_CLR_M  (BIT(7))
#define USB_DEVICE_STUFF_ERR_INT_CLR_V  0x1
#define USB_DEVICE_STUFF_ERR_INT_CLR_S  7
/* USB_DEVICE_CRC16_ERR_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_CRC16_ERR_INT interrupt..*/
#define USB_DEVICE_CRC16_ERR_INT_CLR    (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_CLR_M  (BIT(6))
#define USB_DEVICE_CRC16_ERR_INT_CLR_V  0x1
#define USB_DEVICE_CRC16_ERR_INT_CLR_S  6
/* USB_DEVICE_CRC5_ERR_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_CRC5_ERR_INT interrupt..*/
#define USB_DEVICE_CRC5_ERR_INT_CLR    (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_CLR_M  (BIT(5))
#define USB_DEVICE_CRC5_ERR_INT_CLR_V  0x1
#define USB_DEVICE_CRC5_ERR_INT_CLR_S  5
/* USB_DEVICE_PID_ERR_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_PID_ERR_INT interrupt..*/
#define USB_DEVICE_PID_ERR_INT_CLR    (BIT(4))
#define USB_DEVICE_PID_ERR_INT_CLR_M  (BIT(4))
#define USB_DEVICE_PID_ERR_INT_CLR_V  0x1
#define USB_DEVICE_PID_ERR_INT_CLR_S  4
/* USB_DEVICE_SERIAL_IN_EMPTY_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt..*/
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_CLR    (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_CLR_M  (BIT(3))
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_CLR_V  0x1
#define USB_DEVICE_SERIAL_IN_EMPTY_INT_CLR_S  3
/* USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt..*/
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_CLR    (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_CLR_M  (BIT(2))
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_CLR_V  0x1
#define USB_DEVICE_SERIAL_OUT_RECV_PKT_INT_CLR_S  2
/* USB_DEVICE_SOF_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_JTAG_SOF_INT interrupt..*/
#define USB_DEVICE_SOF_INT_CLR    (BIT(1))
#define USB_DEVICE_SOF_INT_CLR_M  (BIT(1))
#define USB_DEVICE_SOF_INT_CLR_V  0x1
#define USB_DEVICE_SOF_INT_CLR_S  1
/* USB_DEVICE_JTAG_IN_FLUSH_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt..*/
#define USB_DEVICE_JTAG_IN_FLUSH_INT_CLR    (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_CLR_M  (BIT(0))
#define USB_DEVICE_JTAG_IN_FLUSH_INT_CLR_V  0x1
#define USB_DEVICE_JTAG_IN_FLUSH_INT_CLR_S  0

