espressif/esp-idf/components/soc/esp32s3/include/soc/usb_device_reg.h
#define USB_DEVICE_CONF0_REG          (DR_REG_USB_DEVICE_BASE + 0x18)
/* USB_DEVICE_PHY_TX_EDGE_SEL : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: 0: TX output at clock negedge. 1: Tx output at clock posedge..*/
#define USB_DEVICE_PHY_TX_EDGE_SEL    (BIT(15))
#define USB_DEVICE_PHY_TX_EDGE_SEL_M  (BIT(15))
#define USB_DEVICE_PHY_TX_EDGE_SEL_V  0x1
#define USB_DEVICE_PHY_TX_EDGE_SEL_S  15
/* USB_DEVICE_USB_PAD_ENABLE : R/W ;bitpos:[14] ;default: 1'b1 ; */
/*description: Enable USB pad function..*/
#define USB_DEVICE_USB_PAD_ENABLE    (BIT(14))
#define USB_DEVICE_USB_PAD_ENABLE_M  (BIT(14))
#define USB_DEVICE_USB_PAD_ENABLE_V  0x1
#define USB_DEVICE_USB_PAD_ENABLE_S  14
/* USB_DEVICE_PULLUP_VALUE : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: Control pull up value..*/
#define USB_DEVICE_PULLUP_VALUE    (BIT(13))
#define USB_DEVICE_PULLUP_VALUE_M  (BIT(13))
#define USB_DEVICE_PULLUP_VALUE_V  0x1
#define USB_DEVICE_PULLUP_VALUE_S  13
/* USB_DEVICE_DM_PULLDOWN : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Control USB D- pull down..*/
#define USB_DEVICE_DM_PULLDOWN    (BIT(12))
#define USB_DEVICE_DM_PULLDOWN_M  (BIT(12))
#define USB_DEVICE_DM_PULLDOWN_V  0x1
#define USB_DEVICE_DM_PULLDOWN_S  12
/* USB_DEVICE_DM_PULLUP : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: Control USB D- pull up..*/
#define USB_DEVICE_DM_PULLUP    (BIT(11))
#define USB_DEVICE_DM_PULLUP_M  (BIT(11))
#define USB_DEVICE_DM_PULLUP_V  0x1
#define USB_DEVICE_DM_PULLUP_S  11
/* USB_DEVICE_DP_PULLDOWN : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Control USB D+ pull down..*/
#define USB_DEVICE_DP_PULLDOWN    (BIT(10))
#define USB_DEVICE_DP_PULLDOWN_M  (BIT(10))
#define USB_DEVICE_DP_PULLDOWN_V  0x1
#define USB_DEVICE_DP_PULLDOWN_S  10
/* USB_DEVICE_DP_PULLUP : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: Control USB D+ pull up..*/
#define USB_DEVICE_DP_PULLUP    (BIT(9))
#define USB_DEVICE_DP_PULLUP_M  (BIT(9))
#define USB_DEVICE_DP_PULLUP_V  0x1
#define USB_DEVICE_DP_PULLUP_S  9
/* USB_DEVICE_PAD_PULL_OVERRIDE : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Enable software control USB D+ D- pullup pulldown.*/
#define USB_DEVICE_PAD_PULL_OVERRIDE    (BIT(8))
#define USB_DEVICE_PAD_PULL_OVERRIDE_M  (BIT(8))
#define USB_DEVICE_PAD_PULL_OVERRIDE_V  0x1
#define USB_DEVICE_PAD_PULL_OVERRIDE_S  8
/* USB_DEVICE_VREF_OVERRIDE : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Enable software control input  threshold.*/
#define USB_DEVICE_VREF_OVERRIDE    (BIT(7))
#define USB_DEVICE_VREF_OVERRIDE_M  (BIT(7))
#define USB_DEVICE_VREF_OVERRIDE_V  0x1
#define USB_DEVICE_VREF_OVERRIDE_S  7
/* USB_DEVICE_VREFL : R/W ;bitpos:[6:5] ;default: 2'b0 ; */
/*description: Control single-end input low threshold,0.8V to 1.04V, step 80mV.*/
#define USB_DEVICE_VREFL    0x00000003
#define USB_DEVICE_VREFL_M  ((USB_DEVICE_VREFL_V)<<(USB_DEVICE_VREFL_S))
#define USB_DEVICE_VREFL_V  0x3
#define USB_DEVICE_VREFL_S  5
/* USB_DEVICE_VREFH : R/W ;bitpos:[4:3] ;default: 2'b0 ; */
/*description: Control single-end input high threshold,1.76V to 2V, step 80mV.*/
#define USB_DEVICE_VREFH    0x00000003
#define USB_DEVICE_VREFH_M  ((USB_DEVICE_VREFH_V)<<(USB_DEVICE_VREFH_S))
#define USB_DEVICE_VREFH_V  0x3
#define USB_DEVICE_VREFH_S  3
/* USB_DEVICE_EXCHG_PINS : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: USB D+ D- exchange.*/
#define USB_DEVICE_EXCHG_PINS    (BIT(2))
#define USB_DEVICE_EXCHG_PINS_M  (BIT(2))
#define USB_DEVICE_EXCHG_PINS_V  0x1
#define USB_DEVICE_EXCHG_PINS_S  2
/* USB_DEVICE_EXCHG_PINS_OVERRIDE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Enable software control USB D+ D- exchange.*/
#define USB_DEVICE_EXCHG_PINS_OVERRIDE    (BIT(1))
#define USB_DEVICE_EXCHG_PINS_OVERRIDE_M  (BIT(1))
#define USB_DEVICE_EXCHG_PINS_OVERRIDE_V  0x1
#define USB_DEVICE_EXCHG_PINS_OVERRIDE_S  1
/* USB_DEVICE_PHY_SEL : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Select internal/external PHY.*/
#define USB_DEVICE_PHY_SEL    (BIT(0))
#define USB_DEVICE_PHY_SEL_M  (BIT(0))
#define USB_DEVICE_PHY_SEL_V  0x1
#define USB_DEVICE_PHY_SEL_S  0

#define USB_DEVICE_TEST_REG          (DR_REG_USB_DEVICE_BASE + 0x1C)
/* USB_DEVICE_TEST_RX_DM : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: USB D- rx value in test.*/
#define USB_DEVICE_TEST_RX_DM    (BIT(6))
#define USB_DEVICE_TEST_RX_DM_M  (BIT(6))
#define USB_DEVICE_TEST_RX_DM_V  0x1
#define USB_DEVICE_TEST_RX_DM_S  6
/* USB_DEVICE_TEST_RX_DP : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: USB D+ rx value in test.*/
#define USB_DEVICE_TEST_RX_DP    (BIT(5))
#define USB_DEVICE_TEST_RX_DP_M  (BIT(5))
#define USB_DEVICE_TEST_RX_DP_V  0x1
#define USB_DEVICE_TEST_RX_DP_S  5
/* USB_DEVICE_TEST_RX_RCV : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: USB differential rx value in test.*/
#define USB_DEVICE_TEST_RX_RCV    (BIT(4))
#define USB_DEVICE_TEST_RX_RCV_M  (BIT(4))
#define USB_DEVICE_TEST_RX_RCV_V  0x1
#define USB_DEVICE_TEST_RX_RCV_S  4
/* USB_DEVICE_TEST_TX_DM : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: USB D- tx value in test.*/
#define USB_DEVICE_TEST_TX_DM    (BIT(3))
#define USB_DEVICE_TEST_TX_DM_M  (BIT(3))
#define USB_DEVICE_TEST_TX_DM_V  0x1
#define USB_DEVICE_TEST_TX_DM_S  3
/* USB_DEVICE_TEST_TX_DP : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: USB D+ tx value in test.*/
#define USB_DEVICE_TEST_TX_DP    (BIT(2))
#define USB_DEVICE_TEST_TX_DP_M  (BIT(2))
#define USB_DEVICE_TEST_TX_DP_V  0x1
#define USB_DEVICE_TEST_TX_DP_S  2
/* USB_DEVICE_TEST_USB_OE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: USB pad oen in test.*/
#define USB_DEVICE_TEST_USB_OE    (BIT(1))
#define USB_DEVICE_TEST_USB_OE_M  (BIT(1))
#define USB_DEVICE_TEST_USB_OE_V  0x1
#define USB_DEVICE_TEST_USB_OE_S  1
/* USB_DEVICE_TEST_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Enable test of the USB pad.*/
#define USB_DEVICE_TEST_ENABLE    (BIT(0))
#define USB_DEVICE_TEST_ENABLE_M  (BIT(0))
#define USB_DEVICE_TEST_ENABLE_V  0x1
#define USB_DEVICE_TEST_ENABLE_S  0

#define USB_DEVICE_JFIFO_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x20)
/* USB_DEVICE_OUT_FIFO_RESET : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Write 1 to reset JTAG out fifo..*/
#define USB_DEVICE_OUT_FIFO_RESET    (BIT(9))
#define USB_DEVICE_OUT_FIFO_RESET_M  (BIT(9))
#define USB_DEVICE_OUT_FIFO_RESET_V  0x1
#define USB_DEVICE_OUT_FIFO_RESET_S  9
/* USB_DEVICE_IN_FIFO_RESET : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Write 1 to reset JTAG in fifo..*/
#define USB_DEVICE_IN_FIFO_RESET    (BIT(8))
#define USB_DEVICE_IN_FIFO_RESET_M  (BIT(8))
#define USB_DEVICE_IN_FIFO_RESET_V  0x1
#define USB_DEVICE_IN_FIFO_RESET_S  8
/* USB_DEVICE_OUT_FIFO_FULL : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: 1: JTAG out fifo is full..*/
#define USB_DEVICE_OUT_FIFO_FULL    (BIT(7))
#define USB_DEVICE_OUT_FIFO_FULL_M  (BIT(7))
#define USB_DEVICE_OUT_FIFO_FULL_V  0x1
#define USB_DEVICE_OUT_FIFO_FULL_S  7
/* USB_DEVICE_OUT_FIFO_EMPTY : RO ;bitpos:[6] ;default: 1'b1 ; */
/*description: 1: JTAG out fifo is empty..*/
#define USB_DEVICE_OUT_FIFO_EMPTY    (BIT(6))
#define USB_DEVICE_OUT_FIFO_EMPTY_M  (BIT(6))
#define USB_DEVICE_OUT_FIFO_EMPTY_V  0x1
#define USB_DEVICE_OUT_FIFO_EMPTY_S  6
/* USB_DEVICE_OUT_FIFO_CNT : RO ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: JTAT out fifo counter..*/
#define USB_DEVICE_OUT_FIFO_CNT    0x00000003
#define USB_DEVICE_OUT_FIFO_CNT_M  ((USB_DEVICE_OUT_FIFO_CNT_V)<<(USB_DEVICE_OUT_FIFO_CNT_S))
#define USB_DEVICE_OUT_FIFO_CNT_V  0x3
#define USB_DEVICE_OUT_FIFO_CNT_S  4
/* USB_DEVICE_IN_FIFO_FULL : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: 1: JTAG in fifo is full..*/
#define USB_DEVICE_IN_FIFO_FULL    (BIT(3))
#define USB_DEVICE_IN_FIFO_FULL_M  (BIT(3))
#define USB_DEVICE_IN_FIFO_FULL_V  0x1
#define USB_DEVICE_IN_FIFO_FULL_S  3
/* USB_DEVICE_IN_FIFO_EMPTY : RO ;bitpos:[2] ;default: 1'b1 ; */
/*description: 1: JTAG in fifo is empty..*/
#define USB_DEVICE_IN_FIFO_EMPTY    (BIT(2))
#define USB_DEVICE_IN_FIFO_EMPTY_M  (BIT(2))
#define USB_DEVICE_IN_FIFO_EMPTY_V  0x1
#define USB_DEVICE_IN_FIFO_EMPTY_S  2
/* USB_DEVICE_IN_FIFO_CNT : RO ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: JTAT in fifo counter..*/
#define USB_DEVICE_IN_FIFO_CNT    0x00000003
#define USB_DEVICE_IN_FIFO_CNT_M  ((USB_DEVICE_IN_FIFO_CNT_V)<<(USB_DEVICE_IN_FIFO_CNT_S))
#define USB_DEVICE_IN_FIFO_CNT_V  0x3
#define USB_DEVICE_IN_FIFO_CNT_S  0

